####  Implement and demonstrate the FIND-S algorithm for finding the most specific hypothesis on the titanic dataset.
- Name : Pranit Rohokale

In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('titanic.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
#deleting unneccessary coloums
df.drop(['Ticket','Cabin','Embarked'],axis=1,inplace=True)

In [4]:
m,n=len(df.axes[0]),len(df.axes[1])

cols=list(df.columns)
cols=['Pclass','Name','Sex','Age','SibSp','Parch','Fare','Survived']
df=df.reindex(columns=cols)
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Survived
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,0
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,1
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,1
4,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,0

##### classifying age in ranges 
*   1-20 -> Child
*   21-60 -> adult
*   60+ -> Senior Citizen

In [5]:
ages = ["child","adult","senior citizen"]
x=2 
for i in range (m):
  if df.iloc[i,3]<=20:
    x = 0 # child
  elif df.iloc[i,3]<=60:
    x = 1 # adult
  df.iloc[i,3] = ages[x]

df.head()

In [6]:
#Finding the first positive example
index_of_first_positive = -1
for i in range(m):
  if df.iloc[i,7] == 1:
    index_of_first_positive = i
    break

In [7]:
#Initialize the hypothesis
hypo=[]
for i in range (1,n-1):
  hypo.append(df.iloc[index_of_first_positive,i])
print(hypo)

['Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 'adult', 1, 0, 71.2833, 1]

 **Training the model**

 Applying findS algorithm for first 15 examples

In [16]:
for i in range (index_of_first_positive,15):
  if df.iloc[i,7]==0:
    continue
  for j in range(1,n-1):
    if hypo[j-1]!=df.iloc[i,j]:
      hypo[j-1]='?'
    else:
      hypo[j-1]=df.iloc[i,j]
       
    
print("FINAL HYPOTHESIS : ",hypo)

FINAL HYPOTHESIS :  ['?', 'female', '?', '?', '?', '?', 1]

**Testing the model**

Test on Remaining examples

In [20]:
total_to_test = m-100
total_pass=0
for i in range (100,m):
  flag = True
  for j in range(1,n-1):
    if hypo[j-1]=='?':
      continue
    else:
      if df.iloc[i][j]!=hypo[j-1]:
        flag=False
        break
  total_pass+=(flag==df.iloc[i,7])

In [21]:
total_pass,total_to_test

(692, 791)

**Accuracy**

In [22]:
accuracy=total_pass/total_to_test
accuracy*=100
print("Accuracy : ",accuracy)

Accuracy :  87.48419721871049